---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.HideUnreferencedViewTags
source: html/1906a8c6-a13e-8d93-7d79-11ba3c09fdb7.htm
---
# Autodesk.Revit.DB.PrintParameters.HideUnreferencedViewTags Property

Indicates whether to hide unreferenced view tags when printing.

## Syntax (C#)
```csharp
public bool HideUnreferencedViewTags { get; set; }
```